It appears there is no capacity for the Standard_D2ads_v5 SKU in australiaeast or there is another issue with deploying to this SKU, as changing the SKU to GP_Standard_D4ads_v5 or GP_Standard_D2ds_v4 solved the issue.

I am using terraform, so this is the output:

```  # azurerm_mysql_flexible_server.mysql_server will be created
  + resource "azurerm_mysql_flexible_server" "mysql_server" {
      + administrator_login           = "qerjpazxcj"
      + administrator_password        = (sensitive value)
      + backup_retention_days         = 30
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "australiaeast"
      + name                          = "mysql-aue-tst-web-wp23"
      + public_network_access_enabled = (known after apply)
      + replica_capacity              = (known after apply)
      + replication_role              = (known after apply)
      + resource_group_name           = "rg-aue-tst-web-web23"
      + sku_name                      = "GP_Standard_D2ads_v5"
      + tags                          = {
          + "AppProfile" = "Wordpress"
          + "client"     = "haylix"
          + "env"        = "tst"
        }
      + version                       = (known after apply)
      + zone                          = "1"

      + storage {
          + auto_grow_enabled = (known after apply)
          + iops              = (known after apply)
          + size_gb           = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│
│   with azurerm_subnet.subnet_webapp,
│   on main.tf line 116, in resource "azurerm_subnet" "subnet_webapp":
│  116:   enforce_private_link_endpoint_network_policies = true
│
│ `enforce_private_link_endpoint_network_policies` will be removed in favour of the property `private_endpoint_network_policies_enabled` in version 4.0 of the AzureRM Provider
│
│ (and 5 more similar warnings elsewhere)
╵

Do you want to perform these actions in workspace "tst"?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

azurerm_mysql_flexible_server.mysql_server: Creating...
azurerm_mysql_flexible_server.mysql_server: Still creating... [10s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still creating... [20s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still creating... [30s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still creating... [40s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still creating... [50s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still creating... [1m0s elapsed]
╷
│ Error: creating Flexible Server (Subscription: "8b1497c6-84cd-4092-a6ff-fa526cd345b8"
│ Resource Group Name: "rg-aue-tst-web-web23"
│ Flexible Server Name: "mysql-aue-tst-web-wp23"): polling after Create: Code="InternalServerError" Message="An unexpected error occured while processing the request. Tracking ID: '9fef3332-8311-428c-95ac-186809681bf7'"
│
│   with azurerm_mysql_flexible_server.mysql_server,
│   on main.tf line 67, in resource "azurerm_mysql_flexible_server" "mysql_server":
│   67: resource "azurerm_mysql_flexible_server" "mysql_server" {
│
╵
```

After changing SKU, this is the output:

```
  # azurerm_mysql_flexible_server.mysql_server will be created
  + resource "azurerm_mysql_flexible_server" "mysql_server" {
      + administrator_login           = "qerjpazxcj"
      + administrator_password        = (sensitive value)
      + backup_retention_days         = 30
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "australiaeast"
      + name                          = "mysql-aue-tst23"
      + public_network_access_enabled = (known after apply)
      + replica_capacity              = (known after apply)
      + replication_role              = (known after apply)
      + resource_group_name           = "rg-aue-tst-web-web23"
      + sku_name                      = "GP_Standard_D2ds_v4"
      + tags                          = {
          + "AppProfile" = "Wordpress"
          + "client"     = "haylix"
          + "env"        = "tst"
        }
      + version                       = (known after apply)
      + zone                          = "1"

      + storage {
          + auto_grow_enabled = (known after apply)
          + iops              = (known after apply)
          + size_gb           = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│
│   with azurerm_subnet.subnet_webapp,
│   on main.tf line 117, in resource "azurerm_subnet" "subnet_webapp":
│  117:   enforce_private_link_endpoint_network_policies = true
│
│ `enforce_private_link_endpoint_network_policies` will be removed in favour of the property `private_endpoint_network_policies_enabled` in version 4.0 of the AzureRM Provider
│
│ (and 5 more similar warnings elsewhere)
╵

Do you want to perform these actions in workspace "tst"?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

azurerm_mysql_flexible_server.mysql_server: Creating...
azurerm_mysql_flexible_server.mysql_server: Still creating... [10s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still creating... [20s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still creating... [30s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still creating... [40s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still creating... [50s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still creating... [1m0s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still creating... [1m10s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still creating... [1m20s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still creating... [1m30s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still creating... [1m40s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still creating... [1m50s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still creating... [2m0s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still creating... [2m10s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still creating... [2m20s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still creating... [2m30s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still creating... [2m40s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still creating... [2m50s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still creating... [3m0s elapsed]
azurerm_mysql_flexible_server.mysql_server: Creation complete after 3m4s [id=/subscriptions/8b1497c6-84cd-4092-a6ff-fa526cd345b8/resourceGroups/rg-aue-tst-web-web23/providers/Microsoft.DBforMySQL/flexibleServers/mysql-aue-tst23]
```

Scaling down to GP_Standard_D2ads_v5 from GP_Standard_D4ads_v5  also works, but deleting and recreating fails:

```
  # azurerm_mysql_flexible_server.mysql_server will be updated in-place
  ~ resource "azurerm_mysql_flexible_server" "mysql_server" {
        id                            = "/subscriptions/8b1497c6-84cd-4092-a6ff-fa526cd345b8/resourceGroups/rg-aue-tst-web-web23/providers/Microsoft.DBforMySQL/flexibleServers/mysql-aue-tst23"
        name                          = "mysql-aue-tst23"
      ~ sku_name                      = "GP_Standard_D4ads_v5" -> "GP_Standard_D2ads_v5"
        tags                          = {
            "AppProfile" = "Wordpress"
            "client"     = "haylix"
            "env"        = "tst"
        }
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│
│   with azurerm_subnet.subnet_webapp,
│   on main.tf line 118, in resource "azurerm_subnet" "subnet_webapp":
│  118:   enforce_private_link_endpoint_network_policies = true
│
│ `enforce_private_link_endpoint_network_policies` will be removed in favour of the property `private_endpoint_network_policies_enabled` in version 4.0 of the AzureRM Provider
│
│ (and 5 more similar warnings elsewhere)
╵

Do you want to perform these actions in workspace "tst"?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

azurerm_mysql_flexible_server.mysql_server: Modifying... [id=/subscriptions/8b1497c6-84cd-4092-a6ff-fa526cd345b8/resourceGroups/rg-aue-tst-web-web23/providers/Microsoft.DBforMySQL/flexibleServers/mysql-aue-tst23]
azurerm_mysql_flexible_server.mysql_server: Still modifying... [id=/subscriptions/8b1497c6-84cd-4092-a6ff-...rMySQL/flexibleServers/mysql-aue-tst23, 10s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still modifying... [id=/subscriptions/8b1497c6-84cd-4092-a6ff-...rMySQL/flexibleServers/mysql-aue-tst23, 20s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still modifying... [id=/subscriptions/8b1497c6-84cd-4092-a6ff-...rMySQL/flexibleServers/mysql-aue-tst23, 30s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still modifying... [id=/subscriptions/8b1497c6-84cd-4092-a6ff-...rMySQL/flexibleServers/mysql-aue-tst23, 40s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still modifying... [id=/subscriptions/8b1497c6-84cd-4092-a6ff-...rMySQL/flexibleServers/mysql-aue-tst23, 50s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still modifying... [id=/subscriptions/8b1497c6-84cd-4092-a6ff-...rMySQL/flexibleServers/mysql-aue-tst23, 1m0s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still modifying... [id=/subscriptions/8b1497c6-84cd-4092-a6ff-...rMySQL/flexibleServers/mysql-aue-tst23, 1m10s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still modifying... [id=/subscriptions/8b1497c6-84cd-4092-a6ff-...rMySQL/flexibleServers/mysql-aue-tst23, 1m20s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still modifying... [id=/subscriptions/8b1497c6-84cd-4092-a6ff-...rMySQL/flexibleServers/mysql-aue-tst23, 1m30s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still modifying... [id=/subscriptions/8b1497c6-84cd-4092-a6ff-...rMySQL/flexibleServers/mysql-aue-tst23, 1m40s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still modifying... [id=/subscriptions/8b1497c6-84cd-4092-a6ff-...rMySQL/flexibleServers/mysql-aue-tst23, 1m50s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still modifying... [id=/subscriptions/8b1497c6-84cd-4092-a6ff-...rMySQL/flexibleServers/mysql-aue-tst23, 2m0s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still modifying... [id=/subscriptions/8b1497c6-84cd-4092-a6ff-...rMySQL/flexibleServers/mysql-aue-tst23, 2m10s elapsed]
...
azurerm_mysql_flexible_server.mysql_server: Modifications complete after 7m4s [id=/subscriptions/8b1497c6-84cd-4092-a6ff-fa526cd345b8/resourceGroups/rg-aue-tst-web-web23/providers/Microsoft.DBforMySQL/flexibleServers/mysql-aue-tst23]
```

Deleting and recreating:

```
  # azurerm_mysql_flexible_server.mysql_server is tainted, so must be replaced
-/+ resource "azurerm_mysql_flexible_server" "mysql_server" {
      ~ fqdn                          = "mysql-aue-tst23.mysql.database.azure.com" -> (known after apply)
      ~ id                            = "/subscriptions/8b1497c6-84cd-4092-a6ff-fa526cd345b8/resourceGroups/rg-aue-tst-web-web23/providers/Microsoft.DBforMySQL/flexibleServers/mysql-aue-tst23" -> (known after apply)
        name                          = "mysql-aue-tst23"
      ~ public_network_access_enabled = false -> (known after apply)
      ~ replica_capacity              = 10 -> (known after apply)
      ~ replication_role              = "None" -> (known after apply)
        tags                          = {
            "AppProfile" = "Wordpress"
            "client"     = "haylix"
            "env"        = "tst"
        }
      ~ version                       = "5.7" -> (known after apply)
        # (10 unchanged attributes hidden)

      ~ storage {
          ~ auto_grow_enabled = true -> (known after apply)
          ~ iops              = 360 -> (known after apply)
          ~ size_gb           = 20 -> (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
╷
│ Warning: Argument is deprecated
│
│   with azurerm_subnet.subnet_webapp,
│   on main.tf line 118, in resource "azurerm_subnet" "subnet_webapp":
│  118:   enforce_private_link_endpoint_network_policies = true
│
│ `enforce_private_link_endpoint_network_policies` will be removed in favour of the property `private_endpoint_network_policies_enabled` in version 4.0 of the AzureRM Provider
│
│ (and 5 more similar warnings elsewhere)
╵

Do you want to perform these actions in workspace "tst"?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

azurerm_mysql_flexible_server.mysql_server: Destroying... [id=/subscriptions/8b1497c6-84cd-4092-a6ff-fa526cd345b8/resourceGroups/rg-aue-tst-web-web23/providers/Microsoft.DBforMySQL/flexibleServers/mysql-aue-tst23]
azurerm_mysql_flexible_server.mysql_server: Still destroying... [id=/subscriptions/8b1497c6-84cd-4092-a6ff-...rMySQL/flexibleServers/mysql-aue-tst23, 10s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still destroying... [id=/subscriptions/8b1497c6-84cd-4092-a6ff-...rMySQL/flexibleServers/mysql-aue-tst23, 20s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still destroying... [id=/subscriptions/8b1497c6-84cd-4092-a6ff-...rMySQL/flexibleServers/mysql-aue-tst23, 30s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still destroying... [id=/subscriptions/8b1497c6-84cd-4092-a6ff-...rMySQL/flexibleServers/mysql-aue-tst23, 40s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still destroying... [id=/subscriptions/8b1497c6-84cd-4092-a6ff-...rMySQL/flexibleServers/mysql-aue-tst23, 50s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still destroying... [id=/subscriptions/8b1497c6-84cd-4092-a6ff-...rMySQL/flexibleServers/mysql-aue-tst23, 1m0s elapsed]
azurerm_mysql_flexible_server.mysql_server: Destruction complete after 1m2s
azurerm_mysql_flexible_server.mysql_server: Creating...
azurerm_mysql_flexible_server.mysql_server: Still creating... [10s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still creating... [20s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still creating... [30s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still creating... [40s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still creating... [50s elapsed]
azurerm_mysql_flexible_server.mysql_server: Still creating... [1m0s elapsed]
╷
│ Error: creating Flexible Server (Subscription: "8b1497c6-84cd-4092-a6ff-fa526cd345b8"
│ Resource Group Name: "rg-aue-tst-web-web23"
│ Flexible Server Name: "mysql-aue-tst23"): polling after Create: Code="InternalServerError" Message="An unexpected error occured while processing the request. Tracking ID: '32144422-91bb-4bf1-98ee-aad888793f24'"
│
│   with azurerm_mysql_flexible_server.mysql_server,
│   on main.tf line 67, in resource "azurerm_mysql_flexible_server" "mysql_server":
│   67: resource "azurerm_mysql_flexible_server" "mysql_server" {
│
╵

```